app/Http/Controllers/Profile/DA/CompanyDAController.php

select * from `companies` where `companyID` = 'y$lokVjdAzWxSrGA8anG6kTOWJkwUHYF/f4qtz7xNBSzxq.lucRwvn2' and `companies`.`deleted_at` is null limit 1
select `status`, `phaseID` from `da_phases`
---
    public function index(){

        $emp = Auth::user();
        $c=Company::where('companyID',$emp->companyID)->first();
        $das = DA::where('companyID',$c->companyID)->get();
        $phases = ["" => Lang::get('form.companyDA_stedit_selectph')] + DAPhase::pluck('status', 'phaseID')->all();

select `name`, `emplID` from `employees` where `companyID` = 'y$lokVjdAzWxSrGA8anG6kTOWJkwUHYF/f4qtz7xNBSzxq.lucRwvn2' and `employees`.`deleted_at` is null
---
    public function newda(){

        $emps = [""=>Lang::get('form.companyDAnewdaselect')]+Employee::where('companyID',Auth::user()->companyID)->pluck('name','emplID')->all();