app/Http/Controllers/Profile/DA/TeacherDAController.php

select `name`, `teachID` from `teachers` where `schoolID` = '1392137043850062698275' and `teachers`.`deleted_at` is null
---
    public function settings(Request $request)
    {
        if (($this->validate($request, [
            'daid' => 'required'
        ]))) {

            if (count(DA::where('DAid', $request['daid'])->get()) != 1) {
                return redirect('/company/da/dashboard')->with('fail', Lang::get('messages.unkownERORR'));
            } else {
                $da = DA::where('DAid', $request['daid'])->first();
                if ($da->schoolID != Auth::user()->schoolID) {
                    return redirect()->back()->with(Lang::get('messages.companyDAsteditcompfail'));
                } else {
                    $priv = array('0'=>Lang::get('form.companyDAsettingselectpriv'),'1'=>Lang::get('form.companyDAsettingpriv1'),'2'=>Lang::get('form.companyDAsettingpriv2'),'3'=>Lang::get('form.companyDAsettingpriv3'),'4'=>Lang::get('form.companyDAsettingpriv4'));
                    $tsize = array('0'=>Lang::get('form.companyDAsettingselecttsize'),'1'=>Lang::get('form.companyDAsettingtsize1'),'2'=>Lang::get('form.companyDAsettingtsize2'),'3'=>Lang::get('form.companyDAsettingtsize3'),'4'=>Lang::get('form.companyDAsettingtsize4'),'5'=>Lang::get('form.companyDAsettingtsize5'));
                    $tchs = ["0"=>Lang::get('form.companyDAsettingselectemp')]+Teacher::where('schoolID',Auth::user()->schoolID)->pluck('name','teachID')->all();