app/Http/Controllers/Profile/CompanyProfileController.php

select * from `employees` where `companyID` = 'y$lokVjdAzWxSrGA8anG6kTOWJkwUHYF/f4qtz7xNBSzxq.lucRwvn2' and `employees`.`deleted_at` is null
select * from `companies` where `companyID` = 'y$lokVjdAzWxSrGA8anG6kTOWJkwUHYF/f4qtz7xNBSzxq.lucRwvn2' and `companies`.`deleted_at` is null limit 1
---
    public function index()
    {
        //
        $cid= Auth::user()->companyID;
        $emps = Employee::where('companyID',$cid)->get();
        $emp = Auth::user();
        $comp = Company::where('companyID',$cid)->first();