app/Http/Controllers/Profile/EmployeeHomeController.php

select * from `companies` where `companyID` = 'y$lokVjdAzWxSrGA8anG6kTOWJkwUHYF/f4qtz7xNBSzxq.lucRwvn2' and `companies`.`deleted_at` is null limit 1
select `status`, `phaseID` from `da_phases`
---
    public function index(){
        //dd(Auth::guard());
        //dd(Auth::user());

        /*if(Auth::user()->hasRole('Company') or Auth::user()->hasRole('Company.Premium')){
            return redirect('/chome');
        }else{
            return redirect()->back()->with('fail','Sorry but you don\'t have enough permission to do that :§');
        }*/



        $emp = Auth::user();
        $comp = Company::where('companyID',$emp->companyID)->first();
        $das = DA::where('emplID',Auth::user()->emplID)->orwhere('emplIDz',Auth::user()->emplID)->get();
        $phases = ["" => Lang::get('form.companyDA_stedit_selectph')] + DAPhase::pluck('status', 'phaseID')->all();