app/Http/Controllers/Profile/TeacherHomeController.php

    public function index()
    {
        //
        //dd(Auth::guard());
        $tch = Auth::user();
        $grades = Grade::where('teachID',$tch->teachID)->get();
        $das = DA::where('teachID',$tch->teachID)->get();
        if(count(School::where('schoolID',$tch->schoolID)->get())==1){
            $school = School::where('schoolID',$tch->schoolID)->first();
---
select * from `grades` where `teachID` = '890574362011026589' and `grades`.`deleted_at` is null
select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null
select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null limit 1