app/Http/Controllers/Profile/TeacherProfileController.php

select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null limit 1
select * from `grades` where `teachID` = '890574362011026589' and `grades`.`deleted_at` is null
---
    public function eedit()
    {
        //

        $tch = Auth::user();
        $school = School::where('schoolID',$tch->schoolID)->first();
        $das = DA::where('teachID',$tch->teachID)->get();
        $grades = Grade::where('teachID',$tch->teachID)->get();

select * from `students` where `sid` = '2083513226574609938901' and `students`.`deleted_at` is null limit 1
select * from `teams` where `teamID` = 'y$BItKn...' and `teams`.`deleted_at` is null
select * from `teams` where `teamID` = 'y$BItKn...' and `teams`.`deleted_at` is null limit 1
---
    public function teachindex($sid)
    {
        //$sid =  urldecode($sid);
        $st = Student::where('sid', $sid)->first();
        if($st == null){
            return view('404');
        }
        if($st->teamID != null and $st != ""){
            if(count(Team::where('teamID',$st->teamID)->get()) ==1){
                $team = Team::where('teamID',$st->teamID)->first();

select * from `teams` where `teachID` = '890574362011026589' and `teams`.`deleted_at` is null
select `status`, `phaseID` from `da_phases`
select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null limit 1
---
    public function DAshboard(){

        $tch = Auth::user();
        $das = DA::where('teachID',Auth::user()->teachID)->get();
        $tchdashe = DA::where('emplID', Auth::user()->teachID)->get();
        $tchdasz = DA::where('emplIDz', Auth::user()->teachID)->get();
        $teams = Team::where('teachID',Auth::user()->teachID)->get();
        $phases = ["" => Lang::get('form.companyDA_stedit_selectph')] + DAPhase::pluck('status', 'phaseID')->all();



        $school = School::where('schoolID',$tch->schoolID)->first();