app/Http/Controllers/Teacher/Grade/PdfController.php

    public function pdf($gradeID){
        $gradeID = urldecode($gradeID);
        $students = Student::where('gradeID',$gradeID)->get();
        $grade = Grade::where('gradeID',$gradeID)->first();
        $i = 0;
        $tch = Teacher::where('teachID',$grade->teachID)->first();
        $school=School::where('schoolID',$grade->schoolID)->first();
---
select * from `students` where `gradeID` = '182630753631184599' and `students`.`deleted_at` is null
select * from `grades` where `gradeID` = '182630753631184599' and `grades`.`deleted_at` is null limit 1
select * from `teachers` where `teachID` = '890574362011026589' and `teachers`.`deleted_at` is null limit 1
select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null limit 1