app/Http/Controllers/Teacher/Grade/TeacherGradeController.php

    public function index($gradeID){
        $gradeID = urldecode($gradeID);
        if($grade = Grade::where('gradeID',$gradeID)->first()){
            $tch = Auth::user();
            $school = School::where('schoolID',Auth::user()->schoolID)->first();
            $students = Student::where('gradeID',$gradeID)->orderby('teamID')->get();
            $i = 0;
            if(Student::where('gradeID', $gradeID)->whereNotNull('name')->count() >= ($grade->students)/2){
---
select * from `grades` where `gradeID` = '182630753631184599' and `grades`.`deleted_at` is null limit 1
select * from `schools` where `schoolID` = '1392137043850062698275' and `schools`.`deleted_at` is null limit 1
select * from `students` where `gradeID` = '182630753631184599' and `students`.`deleted_at` is null order by `teamID` asc
select count(*) as aggregate from `students` where `gradeID` = '182630753631184599' and `name` is not null and `students`.`deleted_at` is null